<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of React Native Debugger.</string>
	<key>Identifier</key>
	<string>com.github.iCanHazSoftware.download.ReactNativeDebugger</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>React Native Debugger</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://objects.githubusercontent.com/github-production-release-asset-2e65be/59966901/bda75376-6ba8-4719-a95d-964a7c4cd859?X-Amz-Algorithm=AWS4-HMAC-SHA256&amp;X-Amz-Credential=AKIAIWNJYAX4CSVEH53A%2F20230731%2Fus-east-1%2Fs3%2Faws4_request&amp;X-Amz-Date=20230731T200949Z&amp;X-Amz-Expires=300&amp;X-Amz-Signature=0f79f7dd945b86675d2fd50cc4006c1a942a360789891559e83685eee9334221&amp;X-Amz-SignedHeaders=host&amp;actor_id=131911173&amp;key_id=0&amp;repo_id=59966901&amp;response-content-disposition=attachment%3B%20filename%3Dreact-native-debugger_0.14.0_universal.dmg&amp;response-content-type=application%2Foctet-stream</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/React Native Debugger.app</string>
				<key>requirement</key>
				<string>identifier "com.electron.react-native-debugger" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = Q5AB6DLD5L</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/React Native Debugger.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
